ChrisCarchipulla/RI-Proyecto-G3/firmware_nodo_OpenThread/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c6"

# OpenThread + 802.15.4
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_BORDER_ROUTER=n
CONFIG_OPENTHREAD_CONSOLE_ENABLE=n
CONFIG_IEEE802154_ENABLED=y

# lwIP
CONFIG_LWIP_IPV4=n
CONFIG_LWIP_IPV6=y
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8

# Timekeeping compatible with deep sleep cycles
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
CONFIG_RTC_CLK_SRC_INT_RC=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
